Repository: rincew1nd/CalendarNotificationBot
Catalog: CalendarNotificationBot.Domain/Resources/Resources.SharedResource.*.resx
Languages: ru_ru

# DeleteCalendar_Menu
source: Delete calendar
ru_ru: Удалить календарь

# Information_Menu
source: View profile
ru_ru: Информация

# UpdateContactData_Menu
source: Update contact data
ru_ru: Обновить контактные данные

# UpdateContactDataFromAccount_Menu
source: Update contact data with telegram profile
ru_ru: Обновить контактные данные через контакты

# ChangeTimezone_Menu
source: Change Timezone
ru_ru: Установить часовой пояс

# ChooseAction_Menu
source: Choose action:
ru_ru: Выберите действие:

# ContactData_Menu
source: Share telegram account data
ru_ru: Поделиться контактными данные телеграм

# UpdateNotificationTime_Menu
source: Update notification time
ru_ru: Обновить время оповещения

# Registration_Message
source: This bot is designed to notify users about upcoming events in the provided calendar. The calendar is supplied via a link to an .ICS file, which can be obtained from Bitrix24 or other platforms.
ru_ru: Данный бот предназначен для нотификации пользователей о предстоящих событиях в предоставленном календаре. Календарь предоставляется ссылкой на .ICS файл, который можно найти как в битриксе так и на других платформах.

# UpdateCalendar_Message
source: To provide the calendar link: In Bitrix24, navigate to: Profile > Calendar > Calendars. Click the three dots next to the desired calendar and select Export (iCal). Copy the generated link.
ru_ru: Предоставьте ссылку на календарь в .ICS формате. Инструкции к популярным календарям - <a href="https://support.google.com/calendar/answer/37111?hl=ru">Google</a>, <a href="https://yandex.ru/support/yandex-360/customers/calendar/web/ru/sync/export/">Yandex</a>, <a href="https://helpdesk.bitrix24.ru/open/11866202/">Bitrix24</a>.

# UpdateTimezone_Message
source: To set your time zone: Enter your time zone in the format GMT-\+0. For example: GMT-0, GMT+3.
ru_ru: Введите ваш часовой пояс в формате *GMT-\+0*. Например *GMT-0*, *GMT+3*.

# CalendarDeleted_Message
source: Calendar was deleted
ru_ru: Календарь удалён

# CalendarNotDeleted_Message
source: Calendar was not deleted 'cause calendar or user was not found
ru_ru: Календарь не был удалён так как пользователь или календарь не найден

# ShareContactData_Message
source: Share telegram account data for registration
ru_ru: Отправьте контактные данные в бота для регистрации

# CalendarUpdated_Message
source: Calendar was updated
ru_ru: Календарь обновлён

# UserNotFound_Message
source: User not found
ru_ru: Пользователь не найден

# MalformedLink_Message
source: The calendar link is in an incorrect format. You need to send only a link to a file with the .ICS extension.
ru_ru: Ссылка на календарь в неправильном формате. Необходимо отправить только ссылку на скачивание файла с расширением .ICS

# DataUpdated_Message
source: Contact data updated
ru_ru: Данные обновлены успешно

# DataNotUpdated_Message
source: Failed to update contact data
ru_ru: Данные не обновлены

# TimezoneChanged_Message
source: Timezone was changed to '{0}'
ru_ru: Для пользователя установлена таймзона '{0}'

# UserInfo_Message
source: *Username*\: {0} *Name*\: {1} {2} *User id*\: {3} *Chat Id*\: {4} {5} *Timezone*\: {6} *Culture*\: {7} *Notification time*\: before {8} min
ru_ru: *Тэг пользователя*\: {0} *Имя*\: {1} {2} *Id пользователя*\: {3} *Id чата*\: {4} {5} *Часовой пояс*\: {6} *Язык*\: {7} *Время оповещения*\: за {8} минут

# CalendarNotFound_Message
source: *Calendar was not found*
ru_ru: *Календарь отсутствует*

# CalendarLink_Message
source: Calendar link
ru_ru: Ссылка на календарь

# TimezoneLimit_Message
source: Timezone should be in range from GMT-12 to GMT+15
ru_ru: Часовой пояс должен быть в пределах от GMT-12 до GMT+15

# CalendarEvent_Message
source: <b>{0}</b> <b>Status</b>: {1} <b>Description</b>: {2} <b>Location</b>: {3} <b>Starts at</b>: {4} <b>Duration</b>: {5} minutes ({6})
ru_ru: <b>{0}</b> <b>Статус</b>: {1} <b>Описание</b>: {2} <b>Местоположение</b>: {3} <b>Дата начала</b>: {4} <b>Продолжительность</b>: {5} минут ({6})

# UpdateNotificationTime_Message
source: Provide preferred notification time in minutes. Minimal value - 2, Maximal value - 1440, Default - 15.
ru_ru: Укажите желаемое время оповещения о событии в минутах. Минимальное значение - 2, Максимальное значение - 1440, Стандартное - 15

# IncorrectNotificationTime_Message
source: Please, provide a number between 2 and 1440.
ru_ru: Пожалуйста укажите число между 2 и 1440.
